/*************************************************************
SoE Rom Info v0.1 - 2021

Author: millanzarreta    Date: 17/01/2022

License: GNU GENERAL PUBLIC LICENSE, Version 3, 29 June 2007
*************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <time.h>
#include <math.h>
#if (defined(_WIN32) || defined(_WIN64)) && (!defined(__MINGW32__) || defined(__MINGW64__))
#include <processthreadsapi.h>
#else
#include <unistd.h>
#endif

#define MAX_FILENAME_LEN 4096
#define MAX_STR_LEN 2560
#define MAX_BUFF_SIZE 20480

typedef struct {
	char filein[MAX_FILENAME_LEN];			// input filename (ROM)
	char fileout[MAX_FILENAME_LEN];			// output filename (general)
	int type;								// 0 = autodetect, 1 = unheadered ROM, 2 = headered ROM
	unsigned int hsize;						// header size in bytes
	char spacer;							// spacer in the scv output file
}param_options_type;

typedef struct {
	char filename[MAX_FILENAME_LEN];
	char header_present;
	unsigned int header_size;
	unsigned short int maker_code;
	char maker_code_str[3];
	unsigned int companyId;
	char company_str[MAX_STR_LEN];
	unsigned int game_code;
	char game_code_str[5];
	char valid_fixed_values;
	unsigned char expansion_RAM_size_code;
	unsigned int expansion_RAM_size;
	unsigned char special_version;
	unsigned char cartridge_type;
	char rom_name[22];
	unsigned char map_mode;
	char map_mode_str[MAX_STR_LEN];
	unsigned char type;
	char type_str[MAX_STR_LEN];
	unsigned char region;
	char region_str[MAX_STR_LEN];
	char video_type[MAX_STR_LEN];
	unsigned char rom_size_code;
	unsigned int rom_size;
	unsigned int calculated_rom_size;
	unsigned char sram_size_code;
	unsigned int sram_size;
	char version;
	unsigned short int rom_checksum;
	unsigned short int rom_complement_check;
	char valid_checksum_and_complement;
	unsigned short int real_checksum;
	unsigned short int real_complement_check;
	char coincident_checksum_and_complement;
}rom_info_type;

typedef struct {
	short int index;
	char name[MAX_STR_LEN];
	short int hp;
	short int attack;
	short int defense;
	short int magicdef;
	short int evade;
	short int hit;
	short int aggression_range;
	unsigned short int aggression_chance_code;
	double aggression_chance;
	unsigned short int unique_trait_flags;
	char unique_trait_flags_str[MAX_STR_LEN];
	unsigned short int attack_properties;
	char attack_properties_str[MAX_STR_LEN];
	int experience;
	short int money;
	unsigned char chance_prize_drop_code;
	double chance_prize_drop;
	short int chargeup_limit;
	short int chargeup_gain_per_frame;
	short int unknown_maybe_collision_related;
	unsigned short int palette;
	unsigned short int death_script_nospoils;
	unsigned short int death_script_spoils;
	unsigned short int block_script;
	int stat_ptr;
	int name_ptr;
}npc_stats_type;

typedef struct {
	short int index;						// reverse alphabetical order
	char name[MAX_STR_LEN];
	unsigned short int sprite_info_ptr;
	int sprite_ptr;
	int name_ptr;
	unsigned int ingredient_graphic_setup;	// different order: (alphabetical order except Acorn placed last and Atlas Amulet place between Gunpowder and Iron)
}ingredient_info_type;

typedef struct {
	short int index;
	char name[MAX_STR_LEN];
	char description[MAX_STR_LEN];
	unsigned short int spell_might_value;
	unsigned short int target_flags;
	char target_flags_str[MAX_STR_LEN];
	unsigned char ingredient1;
	unsigned char ingredient2;
	unsigned char ingredient1_cost;
	unsigned char ingredient2_cost;
	char ingredient1_name[MAX_STR_LEN];
	char ingredient2_name[MAX_STR_LEN];
	short int spell_influence_type;
	char spell_influence_type_str[MAX_STR_LEN];
	unsigned short int learned_alchemy_flags_addresses;
	unsigned short int learned_alchemy_flags_bit_weights;
	unsigned short int behaviour_script_ptr;
	unsigned short int invocation_script_ptr;
	unsigned short int sprite_info_ptr;
	unsigned short int unknown_maybe_sprite_related;
	int name_ptr;
	int description_ptr;
}alchemy_info_type;

typedef struct {
	short int index;
	char spell_name[MAX_STR_LEN];
	short int spell_influence_type;
	char spell_influence_type_str[MAX_STR_LEN];
	unsigned short int spell_might_value;
	//unsigned short int spell_power_value;		// Unknown [0x11ADD0-0x11AE30] (97 bytes)
	unsigned short int target_flags;			// Flare spell has a value but is ignored
	char target_flags_str[MAX_STR_LEN];
	unsigned short int invocation_script_ptr;
	unsigned short int sprite_info_ptr;
	int spell_name_ptr;							// 0xE85D4-0xE8653 (all regions) (0x80 bytes, 0x08 bytes each spell) (x00 name ptr) last 3 are messy (13->15, 14->13, 15->14)
	unsigned short int sprite_related_ptr;		// 0xE85D4-0xE8653 (all regions) (0x80 bytes, 0x08 bytes each spell) (x02 sprite related ptr) last 3 are messy (13->15, 14->13, 15->14)
	unsigned short int unknown_value1;			// 0xE85D4-0xE8653 (all regions) (0x80 bytes, 0x08 bytes each spell) (x04 unknown value1) last 3 are messy (13->15, 14->13, 15->14)
	unsigned short int unknown_value2;			// 0xE85D4-0xE8653 (all regions) (0x80 bytes, 0x08 bytes each spell) (x06 unknown value2) last 3 are messy (13->15, 14->13, 15->14)
}callbead_info_type;

typedef struct {
	short int index;
	char name[MAX_STR_LEN];
	char description[MAX_STR_LEN];
	short int attack_power;
	unsigned short int unknown_raw_data[16];
	unsigned short int obtained_flags_addresses;	//13*2=26 (Order: Swords, Axe, Spears, Baz)
	unsigned short int obtained_flags_bit_weights;	//13*2=26 (Order: Swords, Axe, Spears, Baz)
	unsigned short int familie;						//13*2=26 (Order: Swords, Axe, Spears, Baz)
	char familie_str[MAX_STR_LEN];
	int data_ptr;									//15*2=30 (Order: Swords, Axe, Spears, BazMunition)
	int name_ptr;
	int description_ptr;							//12*2=24 (Order: Swords, Axe, Spears)
}weapon_info_type;

typedef struct {
	short int index;
	char name[MAX_STR_LEN];
	short int deffense_value_effective;
	short int deffense_value_visual;
	unsigned short int unknown_pointer1;
	unsigned short int unknown_value1;
	short int default_sell_price;
	int data_ptr;
	unsigned short int sprite_info_ptr;
	int name_ptr;
}armor_info_type;

typedef struct {
	short int index;
	char unit[MAX_STR_LEN];
	int exp_needed_per_level[99];					// 0xC8BD0-0xC8CF8 (0x129) = Boy; 0xC8CFC-0xC8E24 = Dog (0x129) | total experience needed to reach level (99 entries, 3 bytes each)
														// All-non-USA: 0xC8F65-0xC908D [+0x395]; 0xC9091-0xC91B9 [+0x395]
	short int evade_per_level[111];					// 0xC8E25-0xC8F02 (0xDE) = Boy; 0xC8FE1-0xC90BE = Dog (0xDE) | Evade % by level (entries for 0-110, 2 bytes each, Thug's Cloak +5 to used level)
														// All-non-USA: 0xC91BA-0xC9297 [+0x395]; 0xC9376-0xC9453! [+0x395]
	short int hit_per_level[111];					// 0xC8F03-0xC8FE0 (0xDE) = Boy; 0xC90BF-0xC919C = Dog (0xDE) | Hit % by level (entries for 0-110, 2 bytes each, Jade Disk +5 to used level)
														// All-non-USA: 0xC9298-0xC9375 [+0x395]; 0xC9454-0xC9531 [+0x395]
	short int maxhp_per_level[111];					// 0xC919D-0xC927A (0xDE) = Boy; 0xC9515-0xC95F2 = Dog (0xDE) | Max HP by level (entries for 0-110, 2 bytes each, Chocobo Egg +5 to used level)
														// All-non-USA: 0xC9532-0xC960F [+0x395]; 0xC98AA-0xC9987 [+0x395]
	short int base_defense_per_level[111];			// 0xC927B-0xC9358 (0xDE) = Boy; 0xC95F3-0xC96D0 = Dog (0xDE) | base Defense by level (entries for 0-110, 2 bytes each, Staff of Life +5 to used level)
														// All-non-USA: 0xC9610-0xC96ED [+0x395]; 0xC9988-0xC9A65 [+0x395]
	short int base_attack_per_level[111];			// 0xC9359-0xC9436 (0xDE) = Boy; 0xC96D1-0xC97AE = Dog (0xDE) | base Attack by level (entries for 0-110, 2 bytes each, Sun Stone +5 to used level)
														// All-non-USA: 0xC96EE-0xC97CB [+0x395]; 0xC9A66-0xC9B43! [+0x395]
	short int magic_defense_per_level[111];			// 0xC9437-0xC9514 (0xDE) = Boy; 0xC97AF-0xC988C = Dog (0xDE) | Magic Defense by level (entries for 0-110, 2 bytes each, Wizard's Coin +7/+5 to used level)
														// All-non-USA: 0xC97CC-0xC98A9 [+0x395]; 0xC9B44-0xC9C21 [+0x395]
	char text_level_up_str[MAX_STR_LEN];			// 0xF8388-0xF8397 (0x10) = Boy Text: " reaches level "; 0xF856D-0xF857C (0x10) = Dog Text: " reaches level "
														// Europe:  0x51DE8-0x51DF7 [-0xA65A0]; 0x51DE8-0x51DF7 [-0xA6785]
														// Germany: 0x51F04-0x51F14 [-0xA6484]; 0x51F04-0x51F14 [-0xA6669]
														// France:  0x41C38-0x41C48 [-0xB6750]; 0x41C38-0x41C48 [-0xB6935]
														// Spain:   0x41FFD-0x4200D [-0xB638B]; 0x41FFD-0x4200D [-0xB6570]
	char text_weaponlevel_up_str[MAX_STR_LEN];		// 0xF97B1-0xF97BF (0x0F) = Boy Text: " is now level "; 0xF9801-0xF9816 (0x16) = Dog Text: "Dog attack now level "
														// Europe:  0x51DD9-0x51DE7 [-0xA79D8]; 0x51DC3-0x51DD8 [-0xA7A3E]
														// Germany: 0x51EF3-0x51F03 [-0xA78BE]; 0x51EDF-0x51EF2 [-0xA7922]
														// France:  0x41C2B-0x41C37 [-0xB7B86]; 0x41C13-0x41C2A [-0xB7BEE]
														// Spain:   0x41FED-0x41FFC [-0xB77C4]; 0x41FD4-0x41FEC [-0xB782D]
	char level_up_func_str[MAX_STR_LEN];											// 0xF8310-0xF8387 (0x78) = Boy's Level Up handled (function); 0xF84F5-0xF856C (0x78) = Dog's Level Up handled (function)
	unsigned int level_up_func_startaddr;												// Same for ALL!!; All non-USA: 0xF84E5-0xF855C [-0x10]
	unsigned int level_up_func_endaddr;
	unsigned int level_up_func_size;
	unsigned int level_up_func_crc;
	char stats_established_func_str[MAX_STR_LEN];									// 0xF8398-0xF84F4 (0x15D) = Boy's stats established (function); 0xF857D-0xF8688 (0x10C) = Dog's stats established (function)
	unsigned int stats_established_func_startaddr;										// All non-USA: 0xF8388-0xF84E4 [-0x10]; 0xF855D-0xF8668 [-0x20]
	unsigned int stats_established_func_endaddr;
	unsigned int stats_established_func_size;
	unsigned int stats_established_func_crc;
	char weapon_exp_handling_func_str[MAX_STR_LEN];									// 0xF973E-0xF97B0 (0x73) = Boy's Weapon EXP handling (function); 0xF97C0-0xF9800 (0x41) = Dog's Attack EXP handling (function)
	unsigned int weapon_exp_handling_func_startaddr;									// All non-USA: 0xF9714-0xF9786 [-0x2A]; 0xF9787-0xF97C7 [-0x39]
	unsigned int weapon_exp_handling_func_endaddr;
	unsigned int weapon_exp_handling_func_size;
	unsigned int weapon_exp_handling_func_crc;
	char attack_calculation_func_str[MAX_STR_LEN];									// 0xFB75A-0xFB77C (0x23) = Attack Calculations Script (function) $08: Boy Standard; 0xFB77D-0xFB79F (0x23) = Attack Calculations Script (function) $0A: Dog Standard
	unsigned int attack_calculation_func_startaddr;										// All non-USA: 0xFB70B-0xFB72D [-0x4F]; 0xFB72E-0xFB750 [-0x4F]
	unsigned int attack_calculation_func_endaddr;
	unsigned int attack_calculation_func_size;
	unsigned int attack_calculation_func_crc;
	char establish_main_ring_info_func_str[MAX_STR_LEN];							// 0xE9A86-0xE9B39 (0xB4) = Script (function) - Establishes Main Ring information for both Boy and Dog
	unsigned int establish_main_ring_info_func_startaddr;								// Same for ALL!!
	unsigned int establish_main_ring_info_func_endaddr;
	unsigned int establish_main_ring_info_func_size;
	unsigned int establish_main_ring_info_func_crc;
	char update_palettes_status_outline_func_str[MAX_STR_LEN];						// 0x10C9FC-0x10CA9A (0x9F) = Updates Boy and Dog's Palettes based on Status Outline handling (functions)
	unsigned int update_palettes_status_outline_func_startaddr;							// All non-USA: 0x10CA01-0x10CA9F [+0x5]
	unsigned int update_palettes_status_outline_func_endaddr;
	unsigned int update_palettes_status_outline_func_size;
	unsigned int update_palettes_status_outline_func_crc;
	char update_last2colors_status_outline_func_str[MAX_STR_LEN];					// 0x10CA9B-0x10CBB2 (0x118) = Updates last 2 colors of Boy/Dog's Palette for Status Outline (X is Character; alternates between statuses) (function)
	unsigned int update_last2colors_status_outline_func_startaddr;						// All non-USA: 0x10CAA0-0x10CBB7 [+0x5]
	unsigned int update_last2colors_status_outline_func_endaddr;
	unsigned int update_last2colors_status_outline_func_size;
	unsigned int update_last2colors_status_outline_func_crc;
	char establish_current_palette_row_default_and_udpate_func_str[MAX_STR_LEN];	// 0x10CDDC-0x10CE14 (0x39) = Establishes current Palette Row to default one, and also updates Boy/Dog's Palette Row accordingly (Y is entity) (function)
	unsigned int establish_current_palette_row_default_and_udpate_func_startaddr;		// All non-USA: 0x10CDFF-0x10CE37 [+0x23]
	unsigned int establish_current_palette_row_default_and_udpate_func_endaddr;
	unsigned int establish_current_palette_row_default_and_udpate_func_size;
	unsigned int establish_current_palette_row_default_and_udpate_func_crc;
	char spell_instruction_status_outline_palette_bits_set_func_str[MAX_STR_LEN];	// 0x11AC84-0x11ACBC (0x39) = Spell Instruction $44: Boy and Dog's Status Outline Palette Bits set (function)
	unsigned int spell_instruction_status_outline_palette_bits_set_func_startaddr;		// All non-USA: 0x11AC64-0x11AC9C [-0x20]
	unsigned int spell_instruction_status_outline_palette_bits_set_func_endaddr;
	unsigned int spell_instruction_status_outline_palette_bits_set_func_size;
	unsigned int spell_instruction_status_outline_palette_bits_set_func_crc;
	char update_status_outline_status_removal_func_str[MAX_STR_LEN];				// 0x11BB01-0x11BB26 (0x26) = Updates Boy/Dog's Status Outline according to to status removal (Y is entity) (function)
	unsigned int update_status_outline_status_removal_func_startaddr;					// All non-USA: 0x11B9F0-0x11BA15 [-0x111]
	unsigned int update_status_outline_status_removal_func_endaddr;
	unsigned int update_status_outline_status_removal_func_size;
	unsigned int update_status_outline_status_removal_func_crc;
}boydog_info_type;

//////////////////////
// TODO: Possible future data to add
// FriendlyNPCs -> Name (and ptr), Stats_Data (like monsters), Stats_Data_PTR
// Items -> Name (and ptr), TargetingFlags, InvocationScriptPtr, HPRecoveryAmount, SpriteInfoPtr, DefaultSellPrizes
// Charms/Rare Items -> Name (and ptr), Description (and ptr), Type (Charm or Rare), Sprite_ptr, item_flags_(addresses), item_flags_(bit_weights), #total_number_of_charms?
